# todo: การรับค้า  input
fname = input('กรุณาป้อนชื่อของท่าน : ')  # รับค่าที่ผู้ใช้ป้อนแล้วเก็บลงตัวแปร name
lname = input('กรุณาป้อนนามสกุลของท่าน : ')
print('คุณชื่อ = ' + fname + ' ' + lname)
print()
x = input('ปอนตัวเลข ตัวที่ 1 :')  # รับค่าเข้ามา เป็นตัวอักษณ Str จะจะ เอามา + กันไม่ได้
y = input('ปอนตัวเลข ตัวที่ 2 :')

z = x + y
print(z)
print(z)  # output ออกมาเป็นข้อความ ไม่ใช้เป็นตัวเลข int จะต้องแปลงชนิดข้อมูลก่อน +
print(type(z))
print()
z = int(x) + int(y)
print(z)
print(type(z))

# หรือถ้า เราไม่ได้นำ ค่าที่รับเข้ามา ไปใช้ที่อื่นต่อ เราก็ควร กำหนัดตั้งแต่การรับเข้า โดยการ int(input('asdfasdf' : )

x = int(input('ปอนตัวเลข ตัวที่ 1 :'))
y = int(input('ปอนตัวเลข ตัวที่ 2 :'))
z = x + y
print(z)
