# todo: ตัวดำเนินการเปรียบเทียบ (Python Comparison Operators)
'''
https://www.youtube.com/watch?v=KPTcL8Rqq18&list=PLltVQYLz1BMBwqJysYnoEKWXUvqusJpgN&index=13
https://www.w3schools.com/python/python_operators.asp
Python Logical Operators

นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเที่ยบกัน
ชนิดของข้อมูลต้องเหมือนกัน
คำตอบ จะมีค่า แค่ จริง / เท็จ

'''

x, y, z = 5, 7, 9
print('ค่า x มากกว่า y จริงหรือไม่ ? :', x > y)
print('ค่า x น้อยกว่า y จริงหรือไม่ ? :', x < y)
print('ค่า x เท่ากับ y จริงหรือไม่ ? :', x == y)
print('ค่า x ไม่เท่ากับ y จริงหรือไม่ ? :', x != y)

# หรือ or
print()
print('ค่า x มากกว่า หรือ เท่่ากับ y จริงหรือไม่ ? :', x >= y)
print('ค่า x น้อยกว่า หรือ เท่่ากับ y จริงหรือไม่ ? :', x <= y)
print('ค่า 5 มีค่าน้อยกว่า 7 จริงหรือไม่ หรือ 5 มีค่าน้อยกว่า 10 จริงหรือไม่ :', 5 < 7 or 5 < 10)
print('ค่า 5 มีค่าน้อยกว่า 7 จริงหรือไม่ หรือ 10 มีค่าน้อยกว่า 5 จริงหรือไม่ :', 5 < 7 or 10 < 5)
print('ค่า 5 มีค่าน้อยกว่า 3 จริงหรือไม่ หรือ 5 มีค่าน้อยกว่า 10 จริงหรือไม่ :', 5 < 3 or 5 < 10)

# และ
print()
print('ค่า x มากกว่า  y และ Y มากกว่า y จริงหรือไม่ ? :', x > y > z)
print('ค่า x น้อยกว่า  y และ Y น้อยกว่า z จริงหรือไม่ ? :', x < y < z)
print('ค่า x น้อยกว่า  y และ Y น้อยกว่า z จริงหรือไม่ ? :', x < y and y < z)  # T และ T =T
print('ค่า x มากกว่า  y และ Y น้อยกว่า z จริงหรือไม่ ? :', x > y and y < z)  # F และ T =F
print('ค่า x มากกว่า  Y และ Y มากกว่า z จริงหรือไม่ ? :', x > y and y > z)  # F และ F =F
